In [13]:
%reload_ext sql

In [96]:
%%sql postgresql://superuser:superuserpass@localhost/app
        select * from api.todos;

3 rows affected.

[(1, 'up1', False, None),
 (3, 'item_3', False, None),
 (6, 'item_6', False, None)]

In [15]:
%sql select 1;

1 rows affected.

[(1,)]

In [16]:
import os
os.getcwd()

'/Users/mertnuhoglu/projects/study/py/jupyter'

In [22]:
import anosql
import psycopg2
import sqlite3

# PostgreSQL
conn = psycopg2.connect('postgresql://superuser:superuserpass@localhost/app')
queries = anosql.load_queries('postgres', 'sql/study01.sql')
queries.select1(conn)

[(1,)]

In [23]:
queries.select2(conn)

[(2,)]

In [27]:
with open('sql/study01.sql', 'r') as fin:
    print(fin.read())

-- name: select1
SELECT 1;

-- name: select2
SELECT 2;

In [44]:
%config SqlMagic.displaylimit = 5
%sql select * from pg_catalog.pg_tables pt where pt.schemaname = 'pg_catalog';

55 rows affected.

[('pg_catalog', 'pg_statistic', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_type', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_authid', 'postgres', 'pg_global', True, False, False, False),
 ('pg_catalog', 'pg_user_mapping', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_attribute', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_proc', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_class', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_attrdef', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_constraint', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_inherits', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_index', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_operator', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_opfamily', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_opclass', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_am', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_amop', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_amproc', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_language', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_largeobject_metadata', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_aggregate', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_rewrite', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_largeobject', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_trigger', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_event_trigger', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_description', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_cast', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_enum', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_namespace', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_conversion', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_depend', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_database', 'postgres', 'pg_global', True, False, False, False),
 ('pg_catalog', 'pg_db_role_setting', 'postgres', 'pg_global', True, False, False, False),
 ('pg_catalog', 'pg_tablespace', 'postgres', 'pg_global', True, False, False, False),
 ('pg_catalog', 'pg_pltemplate', 'postgres', 'pg_global', True, False, False, False),
 ('pg_catalog', 'pg_auth_members', 'postgres', 'pg_global', True, False, False, False),
 ('pg_catalog', 'pg_shdepend', 'postgres', 'pg_global', True, False, False, False),
 ('pg_catalog', 'pg_shdescription', 'postgres', 'pg_global', True, False, False, False),
 ('pg_catalog', 'pg_ts_config', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_ts_config_map', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_ts_dict', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_ts_parser', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_ts_template', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_extension', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_foreign_data_wrapper', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_foreign_server', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_foreign_table', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_policy', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_replication_origin', 'postgres', 'pg_global', True, False, False, False),
 ('pg_catalog', 'pg_default_acl', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_init_privs', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_seclabel', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_shseclabel', 'postgres', 'pg_global', True, False, False, False),
 ('pg_catalog', 'pg_collation', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_range', 'postgres', None, True, False, False, False),
 ('pg_catalog', 'pg_transform', 'postgres', None, True, False, False, False)]

In [45]:
%sql select * from pg_catalog.pg_tables pt where pt.schemaname = 'api';

0 rows affected.

[]

In [46]:
%sql select * from pg_catalog.pg_views pv where pv.schemaname = 'api';

5 rows affected.

[('api', 'todos', 'api', ' SELECT todo.id,\n    todo.todo,\n    todo.private,\n    (todo.owner_id = request.user_id()) AS mine\n   FROM data.todo;'),
 ('api', 'clients', 'superuser', ' SELECT client.id,\n    client.name,\n    client.address,\n    client.created_on,\n    client.updated_on\n   FROM data.client;'),
 ('api', 'projects', 'superuser', ' SELECT project.id,\n    project.name,\n    project.client_id,\n    project.created_on,\n    project.updated_on\n   FROM data.project;'),
 ('api', 'tasks', 'superuser', ' SELECT task.id,\n    task.name,\n    task.completed,\n    task.project_id,\n    task.created_on,\n    task.updated_on\n   FROM data.task;'),
 ('api', 'comments', 'superuser', " SELECT project_comment.id,\n    project_comment.body,\n    'project'::text AS parent_type,\n    project_comment.project_id AS parent_id,\n    projec ... (277 characters truncated) ... ,\n    NULL::integer AS project_id,\n    task_comment.task_id,\n    task_comment.created_on,\n    task_comment.updated_on\n   FROM data.task_comment;")]

In [48]:
%sql select user;

1 rows affected.

[('superuser',)]

In [50]:
%sql select '$user';

1 rows affected.

[('$user',)]

In [51]:
%sql select '{Alex,Sonia}'::text[] As name;

1 rows affected.

[(['Alex', 'Sonia'],)]

In [52]:
%sql select unnest('{Alex,Sonia}'::text[]) As name;

2 rows affected.

[('Alex',), ('Sonia',)]

In [53]:
%sql SELECT unnest(string_to_array('split.this', '.')) As x;

2 rows affected.

[('split',), ('this',)]

In [54]:
%sql SELECT unnest(regexp_matches('100 hats 200', '\d+', 'g'));

2 rows affected.

[('100',), ('200',)]

In [89]:
%%sql 
SELECT '2012-03-11 3:10 AM America/Los_Angeles'::timestamptz AS america
, '2012-03-11 3:10 AM'::timestamptz as istanbul1
, '2012-03-11 3:10 AM GMT-3'::timestamptz as istanbul2
, '2012-03-11 3:10'::timestamptz::date as date1
;

1 rows affected.

[('2012-03-11 10:10:00+00', '2012-03-11 03:10:00+00', '2012-03-11 00:10:00+00', '2012-03-11')]

In [86]:
works = %sql SELECT 1,2

1 rows affected.

In [90]:
%%sql
SELECT
  a
  , extract('year' from b)
  FROM
    ( VALUES
      ( '2012-03-11 3:10 AM'::timestamptz
      , '1012-03-11 3:10'::timestamptz::date)
    ) dates(a,b)
;

1 rows affected.

[('2012-03-11 03:10:00+00', 1012.0)]

In [91]:
%%sql
SELECT
  *
  FROM
    ( VALUES
      ( '2012-03-11 3:10 AM'::timestamptz
      , '1012-03-11 3:10'::timestamptz::date)
    ) dates
;

1 rows affected.

[('2012-03-11 03:10:00+00', '1012-03-11')]

In [92]:
%%sql
SELECT
  column1
  FROM
    ( VALUES
      ( '2012-03-11 3:10 AM'::timestamptz
      , '1012-03-11 3:10'::timestamptz::date)
    ) dates
;

1 rows affected.

[('2012-03-11 03:10:00+00',)]

In [93]:
%%sql
SELECT
  *
  FROM
    ( VALUES
      ( '2012-03-11 3:10 AM'::timestamptz
      , '1012-03-11 3:10'::timestamptz::date)
    ) AS dates
;

1 rows affected.

[('2012-03-11 03:10:00+00', '1012-03-11')]

In [94]:
%sql select '[2012-04-24, infinity]'::daterange;

1 rows affected.

[(DateRange('2012-04-24', 'infinity', '[)'),)]

In [106]:
%%sql
CREATE TABLE public.families_j (
  doc_id int GENERATED BY DEFAULT AS IDENTITY PRIMARY KEY,
  profile jsonb
);

select * from public.families_j;

Done.
0 rows affected.

[]

In [107]:
%sql DROP TABLE public.families_j;

Done.

[]

In [108]:
%sql CREATE SCHEMA study;

(psycopg2.ProgrammingError) schema "study" already exists
 [SQL: 'CREATE SCHEMA study;']

In [110]:
%%sql
CREATE TABLE study.families_j (
  doc_id int GENERATED BY DEFAULT AS IDENTITY PRIMARY KEY,
  profile jsonb
);

Done.

[]

In [111]:
%sql select * from study.families_j;

0 rows affected.

[]

In [122]:
%%sql 
-- multiple rows per insert values
INSERT INTO study.families_j (profile) VALUES 
     ('{"name":"Gomez", "members": [{"member":{"relation":"padre"}}]}')
    ,('{"name":"Sanchez", "members": [{"member":{"relation":"madre"}}]}')
;
SELECT * FROM study.families_j;

2 rows affected.
2 rows affected.

[(6, {'name': 'Gomez', 'members': [{'member': {'relation': 'padre'}}]}),
 (7, {'name': 'Sanchez', 'members': [{'member': {'relation': 'madre'}}]})]

In [120]:
%sql select profile->'members' from study.families_j;

2 rows affected.

[([{'member': {'relation': 'padre'}}],),
 ([{'member': {'relation': 'madre'}}],)]

In [128]:
%sql select profile->>'members' as name from study.families_j;

2 rows affected.

[('[{"member": {"relation": "padre"}}]',),
 ('[{"member": {"relation": "madre"}}]',)]

In [129]:
%sql select profile->'name' as name from study.families_j;

2 rows affected.

[('Gomez',), ('Sanchez',)]

In [130]:
%sql select profile->'members'->'member' from study.families_j;

2 rows affected.

[(None,), (None,)]

In [131]:
%sql select profile->'members'->>'member' from study.families_j;

2 rows affected.

[(None,), (None,)]

In [138]:
%sql select profile->'members'->'member'->>'relation' from study.families_j;

2 rows affected.

[(None,), (None,)]

In [139]:
%sql select profile->'members'->0#>>'{member}' from study.families_j;

2 rows affected.

[('{"relation": "padre"}',), ('{"relation": "madre"}',)]

In [143]:
%sql select profile->'members'->0->'member'->'relation' from study.families_j;

2 rows affected.

[('padre',), ('madre',)]

In [133]:
%sql CREATE TABLE study.books ( id integer, data json );

(psycopg2.ProgrammingError) relation "books" already exists
 [SQL: 'CREATE TABLE study.books ( id integer, data json );']

In [134]:
%%sql
INSERT INTO study.books VALUES (1,
  '{ "name": "Book the First", "author": { "first_name": "Bob", "last_name": "White" } }');
INSERT INTO study.books VALUES (2,
  '{ "name": "Book the Second", "author": { "first_name": "Charles", "last_name": "Xavier" } }');
INSERT INTO study.books VALUES (3,
  '{ "name": "Book the Third", "author": { "first_name": "Jim", "last_name": "Brown" } }');

1 rows affected.
1 rows affected.
1 rows affected.

[]

In [136]:
%sql SELECT id, data->>'name' AS name FROM study.books;

3 rows affected.

[(1, 'Book the First'), (2, 'Book the Second'), (3, 'Book the Third')]

In [137]:
%sql SELECT id, data->'author'->>'first_name' as author_first_name FROM study.books;

3 rows affected.

[(1, 'Bob'), (2, 'Charles'), (3, 'Jim')]

In [146]:
!head sql/library.sql

CREATE TABLE Book(  --df: mult=100.0
  bid SERIAL PRIMARY KEY,
  title TEXT NOT NULL,
  isbn ISBN13 NOT NULL
);
CREATE TABLE Reader(
  rid SERIAL PRIMARY KEY,
  firstname TEXT NOT NULL,
  lastname TEXT NOT NULL,
  born DATE NOT NULL,

In [147]:
!datafiller --size=100 sql/library.sql > sql/library_test_data.sql

In [148]:
!head sql/library_test_data.sql

-- data generated by /usr/local/bin/datafiller version 2.0.0 (r792 on 2014-03-23) for postgresql

-- fill table book (10000)
\echo # filling table book (10000)
COPY book (bid,title,isbn) FROM STDIN (ENCODING 'utf-8');
1	title_240_2	9784253959209
2	title_1462_146	9780731202522
3	title_766_7	9788068420503
4	title_3402	9782520531288